/*
** RULIAN PROJECT, 2023
** PMGG
** File description:
** character_table ☃
*/

#define     CHARACTER_NUMBER    0x01DF
static char[CHARACTER_NUMBER] character_table;
character_table = "ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷ\
へべぺほぼぽまみむめもゃやゅゆょよらりるれろわをんァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナ\
ニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロワヲン\
０１２３４５６７８９ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ\
\t！？、。…・／「」『』（）♂♀\
＋ー×÷＝～：；．，♠♣♥♦★◎\
○□△◇＠♪％☀☁☂☃😑☺☹😠⤴︎\
⤵︎💤円\0\0\0\0\0\0\0\0←↑↓→►\
&0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ\
abcdefghijklmnopqrstuvwxyz\
ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐ\
ÑÒÓÔÕÖ×ØÙÚÛÜÝÞßà\
áâãäåæçèéêëìíîïð\
ñòóôõö÷øùúûüýþÿŒ\
œŞşªº\0\0\0$¡¿!?,.…\
･/‘’“”„«»()♂♀+-*\
#=\0~:;♠♣♥♦★◎○□△◇\
@♪%☀☁☂☃😑☺☹😠⤴︎⤵︎💤e\

